#######################################문제1
#(1)
x <- c(-3, 0, 5, -2, 4, 1, 6) ; x #벡터 생성

#(2)
y <- x*x ; y #각 데이터의 제곱으로 이루어진 벡터

#(3)
z <- sum(y); z #각 데이터의 제곱의 합

#(4)
x-2 #각 데이터에서 -2 

#(5)
max(x); min(x); #최댓값, 최솟값

#(6)
x[x>4] #x값이 4보다 큰 원소들

#(7)
length(x) #벡터 x의 길이

#(8)
x <- sort(x) ; x; x<-sort(x, decreasing=T); x #내림차순

#(9)
x <- array(c(-3, 0, 5, -2, 4, 1, 6), dim=c(1,6) ) ; x #행렬 생성
t(x)

#(10)
t(x) %*% x

#(11)~(12)
x <- c(-3, 0, 5, -2, 4, 1, 6) ; x #벡터 생성
x1 <- x*x ; x1
y <- rbind(x,x1); y #행결합
z <- cbind(x,x1); z #열결합










############################################문제2
#(1)
m <- matrix(c(1,5,0,2,5,3,4,5,2,4,3,0,6,7,3,6,7,7,3,5), byrow=T, ncol=5); m #행부터 입력하는 4x5행렬

#(2)
t(m); ##전치행렬

#(3)
r1 <- m[1,]; r1 #첫번째 row만 뽑아낸 행렬 r1

#(4)
c3 <- m[ ,3]; c3 #세번째 col만 뽑아낸 행렬 c3

#(5)
c4 <- m[,c(2,4)] ; c4 #두번째 열과 4번쨰 열만 뽑아낸 c4

#(6)
sub1 <- m[,c(3,4)]; sub2 <-sub1[c(2,3),]; sub2; #추출을 통해 만든 부분행렬

#(7)~(8)
apply(m, 1, mean); #각 행의 평균
apply(m, 2, mean); #각 열의 평균







###################################################문제3
#(1)
x <- c(2.9,2.3,1.2,1.0,2.0,6.2,2.9,2.0,1.1,0.6,2.3,5.7)
matr <- matrix(x, ncol=6 ,byrow=T); matr

#(2)
matr <- matrix(x, ncol=6 ,byrow=T, dimnames=list(c("2019년", "2020년"),c("세계", "미국", "유로존", "일본","한국","중국"))); matr

#(3)
mat_kor1 <- matrix(c(2.0,2.3), ncol=1, dimnames=list(c("2019년", "2020년"), c("한국"))); mat_kor1
mat_kor2 <- matr[, 5]; mat_kor2            

#(4)
matr_1 <- rbind(c(2.9 ,2.3 , 1.2, 1.0, 2.0, 6.2), c(2.9,2.0, 1.1, 0.6, 2.3, 5.7)); matr_1                 #행벡터결합
matr_2 <- cbind(c(2.9,2.9), c(2.3,2.0), c(1.2, 1.1), c(1.0 , 0.6), c(2.0 , 2.3), c(6.2 , 5.7)); matr_2    #열벡터결합

#(5)
mean(matr[1,]) 
mean(matr[2,])
